# RbsElecAnalyticalTotalCoincidentLoad Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsElecAnalyticalTotalCoincidentLoad Property
ParameterTypeId Class See Also
---
"Total Coincident Loads"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsElecAnalyticalTotalCoincidentLoad { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsElecAnalyticalTotalCoincidentLoad As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsElecAnalyticalTotalCoincidentLoad {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace